title: DotNet Startup Hooks
status: test
description: |
  The .NET DLLs listed in the DOTNET_STARTUP_HOOKS environment
  variable are loaded into .NET processes at runtime.

author: Chris Jones - CPIRT, FabFaeb, Antonio Blescia (TheThMando), bmcder02
references:
 - https://persistence-info.github.io/Data/dotnetstartuphooks.html
 - https://github.com/last-byte/PersistenceSniper/blob/main/PersistenceSniper/PersistenceSniper.psm1

logsource:
  product: windows
  category: vql

detection:
  selection:
    EventData|vql:
      x=>x.DOTNET_STARTUP_HOOKS

  condition: selection

vql: |
  x=>dict(EventData=dict(DOTNET_STARTUP_HOOKS={
      SELECT OSPath, Data.value AS Value
      FROM glob(globs=[UserEnv, SystemEnv], accessor="registry")
      WHERE Value
  }))

vql_args:
  UserEnv: HKEY_USERS\*\Environment\DOTNET_STARTUP_HOOKS
  SystemEnv: HKEY_LOCAL_MACHINE\System\ControlSet*\Control\Session Manager\Environment\DOTNET_STARTUP_HOOKS
