title: Rclone
status: test
description: Check if RClone was used on this system
logsource:
    category: vql
    product: windows

detection:
  selection:
    "EventData|vql":
      x=>x.Files OR x.Registry

  condition: selection

level: high
ruletype: VQL

vql: |
  x=>dict(EventData=dict(
    Files={
      SELECT OSPath, Size, read_file(filename=OSPath, length=100) AS Data
      FROM glob(globs=Path, accessor="auto")
    },
    Registry=to_dict(item={
      SELECT Name AS _key, Data.value AS _value
      FROM glob(globs=Key, accessor="registry")
    })))

vql_args:
  Path: C:\Users\*\AppData\Roaming\rclone\rclone.conf
  Key: HKEY_USERS\*\SOFTWARE\Microsoft\Windows NT\CurrentVersion\AppCompatFlags\Compatibility Assistant\Store\*rclone*
