title: RMM CentraStage (Now Datto) (filesystem)
description: |
   CentraStage (Now Datto) is a remote monitoring and management (RMM) tool. More information will be added as it becomes available.

logsource:
  category: filesystem
  product: windows
  service: glob

detection:
  condition: selection
  selection:
   - Name:
     - CagService.exe
     - AEMAgent.exe

details: Detected RMM executable %EventData.OSPath%
enrichment: |
  x=>dict(
   Hash=hash(path=x.EventData.OSPath))
