title: Credentials access from backups via Rundll32
description: |
  Detects an attempt to obtain credentials from credential backups.
id: ff43852c-486c-4870-a318-ce976d2231a5

logsource:
  category: etw
  product: windows
  service: kernel

detection:
  etw_process:
    EventType: ProcessStart

  process_name:
    ProcessName|re: rundll32.exe

  commandline:
    CommandLine|re:
      - KRShowKeyMgr
      - keymgr.dll

  condition: etw_process and process_name and commandline

details: "Process %ProcessName% launched %CommandLine%"
