title: Credential discovery via VaultCmd.exe
description: |
  Detects the usage of the VaultCmd tool to list Windows Credentials.
  VaultCmd creates, displays and deletes stored credentials.

id: 2ce607d3-5a14-4628-be8a-22bcde97dab5

logsource:
  category: etw
  product: windows
  service: kernel

detection:
  etw_process:
    EventType: CreateProcess

  process_name:
    ProcessName|re: VaultCmd.exe

  commandline:
    CommandLine|re:
      - /listcreds:Windows Credentials
      - /listcreds:Web Credentials

  condition: etw_process and process_name and commandline

details: "Process %ProcessName% launched %CommandLine%"
