title: PowerShell Scripts Installed as Services
id: a2e5019d-a658-4c6a-92bf-7197b54e2cae
status: test
description: Detects powershell script installed as a Service
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
    - https://thedfirreport.com/2023/12/04/sql-brute-force-leads-to-bluesky-ransomware/
author: oscd.community, Natalia Shornikova
date: 2020/10/06
modified: 2022/12/25
tags:
    - attack.execution
    - attack.t1569.002
    - attack.privilege_escalation
    - attack.persistence
    - os.windows
    - windows.services
logsource:
    product: windows
    service: services
detection:
    selection:
        ImagePath|contains:
            - 'powershell'
            - 'pwsh'
    condition: selection
falsepositives:
    - Unknown
level: high
