title: Mstsc.EXE Execution From Uncommon Parent
id: ff3b6b39-e765-42f9-bb2c-ea6761e0e0f6
status: experimental
description: Detects potential RDP connection via Mstsc using a local ".rdp" file
    located in suspicious locations.
references:
    - https://www.blackhillsinfosec.com/rogue-rdp-revisiting-initial-access-methods/
    - https://blog.thickmints.dev/mintsights/detecting-rogue-rdp/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/04/18
modified: 2023/04/18
tags:
    - attack.lateral_movement
    - windows
    - evtx
logsource:
    category: process_creation
    product: windows
    service:  evtx-security
detection:
    selection_parent:
        ParentProcessName|endswith:
            - \brave.exe
            - \CCleanerBrowser.exe
            - \chrome.exe
            - \chromium.exe
            - \firefox.exe
            - \iexplore.exe
            - \microsoftedge.exe
            - \msedge.exe
            - \opera.exe
            - \vivaldi.exe
            - \whale.exe
            - \outlook.exe
    selection_img:
        -   NewProcessName|endswith: \mstsc.exe
    condition: all of selection_*
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
