title: Potential Obfuscated Ordinal Call Via Rundll32
id: 43fa5350-db63-4b8f-9a01-789a427074e1
status: experimental
description: Detects execution of "rundll32" with potential obfuscated ordinal calls
references:
    - Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/05/17
tags:
    - attack.defense_evasion
    - windows
    - evtx
    - lolbas
logsource:
    category: process_creation
    product: windows
    service:  evtx-security
detection:
    selection_img:
        -   NewProcessName|endswith: \rundll32.exe
        -   CommandLine|contains: rundll32
    selection_cli:
        CommandLine|contains:
            - '#+'
            - '#-'
    condition: all of selection_*
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
