title: MSSQL XPCmdshell Option Change
id: d08dd86f-681e-4a00-a92c-1db218754417
status: test
description: Detects when the MSSQL "xp_cmdshell" stored procedure setting is changed
references:
    - https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/
    - https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
    - https://thedfirreport.com/2023/12/04/sql-brute-force-leads-to-bluesky-ransomware/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/07/12
tags:
    - attack.execution
    - windows
    - evtx
    - database
    - software.mssql
logsource:
    product: windows
    service: evtx/application
detection:
    application:
        Channel: Application
    selection:
        Provider_Name: MSSQLSERVER
        EventID: 15457
        Data|contains: xp_cmdshell
    condition: application and selection
falsepositives:
    - Legitimate enable/disable of the setting
    - Note that since the event contain the change for both values. This means that
        this will trigger on both enable and disable
level: high
ruletype: Sigma
