title: Remote Thread Creation Ttdinject.exe Proxy
id: c15e99a3-c474-48ab-b9a7-84549a7a9d16
status: test
description: Detects a remote thread creation of Ttdinject.exe used as proxy
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Ttdinject/
author: frack113
date: 2022/05/16
modified: 2022/06/02
tags:
    - attack.defense_evasion
    - attack.t1127
    - sysmon
    - lolbas
    - os.windows
    - windows.event_logs
    - generic
logsource:
    category: create_remote_thread
    product: evtx
    service: sysmon
detection:
    create_remote_thread:
        EventID: 8
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        SourceImage|endswith: \ttdinject.exe
    condition: create_remote_thread and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
