title: Microsoft Office AI Hijacking
description: |
   Office executables like WINWORD.exe look for AI.exe under the
   %ProgramFiles%\Microsoft Office\root\<Office Version> and
   %ProgramFiles(x86)%\Microsoft Office\root\<Office Version>
   directories.

   An attacker may place a malicious AI.exe there in order to have
   persistence whenever a user interacts with the Microsoft Office
   Suite.

reference:
  - https://twitter.com/laughing_mantis/status/1645268114966470662
  - https://github.com/last-byte/PersistenceSniper/blob/main/PersistenceSniper/PersistenceSniper.psm1

logsource:
    category: vql
    product: windows

detection:
  selection:
    "EventData|vql":
      x=>x.AI

  condition: selection

level: high
ruletype: VQL

details: |
  Microsoft Office AI.exe found %EventData.AI%

vql: |
  x=>dict(
    Timestamp=timestamp(epoch=now()),
    EventData=dict(
       AI={
         SELECT OSPath, Size, Mtime,
                hash(path=OSPath) AS Hash
         FROM glob(globs="*:/Program File*/Microsoft Office/root/Office*/ai.exe")
       }
    )
  )
