title: UAC Bypass via Event Viewer (VQL)
description: Detects UAC bypass method using Windows event viewer
references:
    - https://enigma0x3.net/2016/08/15/fileless-uac-bypass-using-eventvwr-exe-and-registry-hijacking/
    - https://www.hybrid-analysis.com/sample/e122bc8bf291f15cab182a5d2d27b8db1e7019e4e96bb5cdbd1dfe7446f3f51f?environmentId=100
author: Florian Roth (Nextron Systems)
date: 2017-03-19
modified: 2023-09-28
logsource:
    category: vql
    product: windows

detection:
  selection:
    EventData.Hooks|re: .exe
  condition: selection

vql: |
  x=>dict(
    Timestamp=timestamp(epoch=now()),
    EventData=dict(
      Hooks=SearchRegistryKeys(Glob=[
        "HKEY_USERS\\*\\Software\\Classes\\mscfile\\shell\\open\\command\\*",
      ]))
    )

level: high
