title: File access to SAM database
description: |
  Identifies access to the Security Account Manager on-disk database.

id: e3dace20-4962-4381-884e-40dcdde66626
logsource:
  category: etw
  product: windows
  service: file

detection:
  etw_file:
    EventID: 12
    Channel: Microsoft-Windows-Kernel-File

  selection:
    ETWFileName|re: ".+WINDOWS\\\\SYSTEM32\\\\CONFIG\\\\SAM$"
    EventType: FileOpen

  exclusion:
   ProcessExe|re:
     - "^.:\\\\Program Files\\\\"
     - "^.:\\\\Windows\\\\System32\\\\lsass.exe"

  condition: etw_file and selection and not exclusion

details: "Process %ProcessExe% accessed file %ETWFileName%"
