title: Directory Services Restore Mode Accessible by Local Administrator
status: test
description: |
   The password used to enter Directory Services Restore Mode (DSRM)
   is the password set to the local administrator of a Domain
   Controller during DCPROMO. If the DsrmAdminLogonBehavior property
   of the HKLM:\System\CurrentControlSet\Control\Lsa key is set to 2,
   this password can be used to access the Domain Controller with the
   local administrator account.

author: Chris Jones - CPIRT, FabFaeb, Antonio Blescia (TheThMando), bmcder02
references:
- https://github.com/last-byte/PersistenceSniper/blob/main/PersistenceSniper/PersistenceSniper.psm1
- https://adsecurity.org/?p=1785

logsource:
  product: windows
  category: vql

detection:
  selection:
    EventData.DsrmAdminLogonBehavior:
      - 2

  condition: selection

details: |
  DsrmAdminLogonBehavior is set to %EventData.DsrmAdminLogonBehavior%

vql: |
  x=>dict(
     Timestamp=timestamp(epoch=now()),
     EventData=dict(
        DsrmAdminLogonBehavior=GetValue(OSPath=LSAKey)
    ))

vql_args:
  LSAKey: HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\Lsa\DsrmAdminLogonBehavior
