title: Remote Access Tool Services
id: 57bff678-25d1-4d6c-8211-8ca106d12053
status: test
description: |
    An adversary may use legitimate desktop support and remote access software, such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive command and control channel to target systems within networks.
    These services are commonly used as legitimate technical support software, and may be allowed by application control within a target environment.
    Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared with other legitimate software commonly used by adversaries. (Citation: Symantec Living off the Land)
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-5---screenconnect-application-download-and-install-on-windows
author: bmcder02
date: 2023/12/22
modified: 2023/12/22
tags:
    - attack.command_and_control
    - attack.t1219
    - attack.persistence
    - windows
    - windows.services
logsource:
    category: persistence
    product: windows
    service: services
detection:
      service_Name|contains:
          - 'TeamViewer'
          - 'GoToAssist'
          - 'LogMeIn'
          - 'AmmyyAdmin'
          - 'VNC'
          - 'UltraVNC'
          - 'TightVNC'
          - 'RealVNC'
          - 'AnyDesk'
          - 'ScreenConnect'
          - 'SplashTop'
          - 'OpenSSH'
      service_DisplayName|contains:
          - 'TeamViewer'
          - 'GoToAssist'
          - 'LogMeIn'
          - 'AmmyyAdmin'
          - 'VNC'
          - 'UltraVNC'
          - 'TightVNC'
          - 'RealVNC'
          - 'AnyDesk'
          - 'ScreenConnect'
          - 'SplashTop'
          - 'OpenSSH'
      service_AbsoluteExePath|contains:
          - 'TeamViewer'
          - 'GoToAssist'
          - 'LogMeIn'
          - 'AmmyyAdmin'
          - 'VNC'
          - 'UltraVNC'
          - 'TightVNC'
          - 'RealVNC'
          - 'AnyDesk'
          - 'ScreenConnect'
          - 'SplashTop'
          - 'OpenSSH'
      condition: any
falsepositives:
    - Legitimate usage of the tool
level: informational
ruletype: Velociraptor
