author: Zach Mathis
date: 2022/02/05
modified: 2023/01/13

title: Proc Exec (Non-Exe Filetype)
description: Checks whether the image specified in a process creation event doesn't refer to an .exe file.

id: 8d1487f1-7664-4bda-83b5-cb2f79491b6a
level: high
status: stable
logsource:
    category: process_creation
    product: windows
    service: evtx-sysmon
    definition: 'Sysmon needs to be installed and configured.'
detection:
    filter_exes:
        Image|endswith: '.exe'
    filter_system_processes:
        - Image: 'C:\Windows\System32\scrnsave.scr'
        - Image: 'C:\Windows\SysWOW64\scrnsave.scr'
    condition: not (filter_exes or filter_system_processes)
falsepositives:
    - 'normal system usage'
tags:
    - attack.defense_evasion
    - sysmon
references:
    - Based on a sigma rule by Max Altgelt but re-written due to many false positives and potential for false negatives.
ruletype: Hayabusa